jonathanhawkins/SenseCAP-Watcher-Firmware/examples/aligned-realtime/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_ESP_EVENT_POST_FROM_ISR=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_32=y
CONFIG_LK_EXAMPLE_SPEAKER_VOLUME=95

# Align BSP/LVGL tuning - reduced buffer for SPI bandwidth headroom
CONFIG_BSP_LCD_PANEL_SPI_TRANS_Q_DEPTH=4
CONFIG_BSP_LCD_SPI_DMA_SIZE_DIV=16
CONFIG_LVGL_DRAW_BUFF_HEIGHT=40
CONFIG_LVGL_PORT_TASK_PRIORITY=11
CONFIG_LVGL_PORT_TASK_AFFINITY_CPU1=y
CONFIG_LVGL_PORT_TASK_STACK_ALLOC_EXTERNAL=y
CONFIG_LVGL_INPUT_DEVICE_SENSITIVITY=20
CONFIG_LVGL_PORT_TASK_MAX_SLEEP_MS=5

# Legacy I2C driver for esp_codec_dev compatibility
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=y

# FreeRTOS timer task stack size - CRITICAL for disconnect handling
# Default 2048 causes stack overflow during LVGL timer callbacks
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_TIMER_TASK_STACK_DEPTH=4096

### NOTE: LVGL_DRAW_BUFF_HEIGHT=40 + SPI_TRANS_Q_DEPTH=4 provides headroom for volume HUD overlays.
